In [1]:
# coding:utf-8
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from matplotlib import pyplot as plt

In [2]:
# DataFrame相当于将Series扩展到了二维

In [3]:
path = r'E:\python\PythonSpace\Git\Python\DataAnalysis\Data\Pandas\data.csv'
df = pd.read_csv(path, encoding="gbk", header=None)
df

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>张三</td>
      <td>21</td>
    </tr>
    <tr>
      <th>1</th>
      <td>李四</td>
      <td>32</td>
    </tr>
    <tr>
      <th>2</th>
      <td>王五</td>
      <td>33</td>
    </tr>
    <tr>
      <th>3</th>
      <td>赵六</td>
      <td>27</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Tom</td>
      <td>43</td>
    </tr>
    <tr>
      <th>5</th>
      <td>Mike</td>
      <td>26</td>
    </tr>
    <tr>
      <th>6</th>
      <td>Jack</td>
      <td>34</td>
    </tr>
    <tr>
      <th>7</th>
      <td>Lucy</td>
      <td>28</td>
    </tr>
  </tbody>
</table>
</div>

In [4]:
df.shape

(8, 2)

In [8]:
# 创建，常用字典创建，字典中的key代表的是列
# index，columns可以没有，它们分别代表行列索引
df = DataFrame({"height" : [175, 188, 169, 179], 
				"age" : np.random.randint(18, 25, size=4),
				"sex" : ["boy", "boy", "girl", "boy"],
				"weight" : [79, 82, 56, 67]},
			    index=["张三", "李四", "王五", "赵六"],
			    columns=["height", "age", "sex", "weight"])
df

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>height</th>
      <th>age</th>
      <th>sex</th>
      <th>weight</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>张三</th>
      <td>175</td>
      <td>23</td>
      <td>boy</td>
      <td>79</td>
    </tr>
    <tr>
      <th>李四</th>
      <td>188</td>
      <td>19</td>
      <td>boy</td>
      <td>82</td>
    </tr>
    <tr>
      <th>王五</th>
      <td>169</td>
      <td>19</td>
      <td>girl</td>
      <td>56</td>
    </tr>
    <tr>
      <th>赵六</th>
      <td>179</td>
      <td>19</td>
      <td>boy</td>
      <td>67</td>
    </tr>
  </tbody>
</table>
</div>

In [9]:
df.index = list("ABCD")
df

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>height</th>
      <th>age</th>
      <th>sex</th>
      <th>weight</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>175</td>
      <td>23</td>
      <td>boy</td>
      <td>79</td>
    </tr>
    <tr>
      <th>B</th>
      <td>188</td>
      <td>19</td>
      <td>boy</td>
      <td>82</td>
    </tr>
    <tr>
      <th>C</th>
      <td>169</td>
      <td>19</td>
      <td>girl</td>
      <td>56</td>
    </tr>
    <tr>
      <th>D</th>
      <td>179</td>
      <td>19</td>
      <td>boy</td>
      <td>67</td>
    </tr>
  </tbody>
</table>
</div>

In [13]:
# 索引（对列进行检索）
age = df["age"]
# age = df["age"].loc["A"]
age

A    23
B    19
C    19
D    19
Name: age, dtype: int32

In [14]:
# 对行进行检索：.loc或者.iloc
df.loc["A"]

height    175
age        23
sex       boy
weight     79
Name: A, dtype: object

In [17]:
# 对多行检索，可以对行进行切片，但是无法对列进行切片，因为列是属性
df1 = df.loc[["A", "B"]]
df2 = df.loc["A" : "C"]
print(df1)
print("-----------")
print(df2)

   height  age  sex  weight
A     175   23  boy      79
B     188   19  boy      82
-----------
   height  age   sex  weight
A     175   23   boy      79
B     188   19   boy      82
C     169   19  girl      56

In [18]:
df["sex"]["B"]

'boy'

In [19]:
df.loc["B", "height"]

188

In [20]:
df.values[2, 1]

19